In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [ ]:
conda install word2number

In [4]:
df=pd.read_csv("C:\\Users\\ramna\\file\\DataFrame\\linear2.csv")

In [5]:
df.test_score.median()

8.0

In [8]:
import math
cal_testscore=math.floor(df.test_score.median())

In [9]:
df.test_score=df.test_score.fillna(cal_testscore)
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [ ]:
reg=linear_model.LinearRegression()

In [ ]:
reg.fit(df[['experience','test_score','interview_score']],df.salary)

In [ ]:
import word2number as wrd